/*
*浙江理工大学计算机协会
*严禁直接复制提交
*作弊行为将会被ACM校队禁止入队 
*@Author:   STZG
*@Language: C
*@Time:     2019年7月25日 
*/
/*======================================代码开始=====================================*/
#include <stdio.h>
int main() 
{
	printf("Nice to meet you!\n");
	return 0;
}
/*======================================代码结束=====================================*/ 
/*
*本题和1001原理相同，均为printf()函数的简单应用
*其中main()、printf()可以称之为函数、方法
*main()称之为主函数，是C语言/C++的程序入口，每一个可以独立运行的程序，必须包含主函数
*printf()是C中基本的输出函数，用于输出内容到控制台，它包含于stdio.h文件中 
*/
