/*
*浙江理工大学计算机协会
*严禁直接复制提交
*作弊行为将会被ACM校队禁止入队 
*@Author:   STZG
*@Language: C
*@Time:     2019年7月25日 
*/
/*======================================代码开始=====================================*/
#include <stdio.h>
 
int main(int argc, char *argv[])
{
    printf("***************\n\n  Very Good!\n\n***************\n");
    return 0;
}
/*======================================代码结束=====================================*/ 
/*
*本题和1001、1002原理相同，均为printf()函数的简单应用
*其中\n为换行符，\称之为 转义字符 ，使得其后的n不再是原来含义，从而\n一起构成了换行符
*需要注意的是因为OJ平台的判题方式，注意空格
*如果多输出空格字符，会导致格式错误或者PE 
*/
