/*
*浙江理工大学计算机协会
*严禁直接复制提交
*作弊行为将会被ACM校队禁止入队 
*@Author:   STZG
*@Language: C
*@Time:     2019年7月31日 
*/
/*======================================代码开始=====================================*/ 
#include <stdio.h>

int main(int argc, char *argv[]) {
    int n;
	double pi;
	float f;
    while(scanf("%f",&f)!=EOF){
	    n=0;
	    pi=0;
	    do{
	        n++;
	        if(n%2==0)
	        	pi=pi-1.0/(2*n-1);
	        else
	        	pi=pi+1.0/(2*n-1);
	    }while(1.0/(2*n-1)>=f); 
	    printf("%.4f\n",pi*4);
   }   
    return 0;
}
/*======================================代码结束=====================================*/ 
/*
*利用公式pai/4=1-1/3+1/5-1/7+...求pai的近似值，
*直到某一项的绝对值小于某个数f为止,我们可以通过控制f的大小来提高pai的精确性 
*本题有精度问题，注意精度
*double数据类型在多次计算以后可能会有误差
*例如多次运算后应该是1.0000...的数据，其值可能是0.9999999... 
*/
