/*
*浙江理工大学计算机协会
*严禁直接复制提交
*作弊行为将会被ACM校队禁止入队 
*@Author:   STZG
*@Language: C
*@Time:     2019年8月3日 
*/
/*======================================代码开始=====================================*/ 
#include<stdio.h>
int main(){
	int n;
	while(~scanf("%d",&n)){
		int a[200];
		for(int i=1;i<=n;i++)a[i]=0;
		for(int i=1;i<=n;i++){
			for(int j=i;j<=n;j+=i){
				a[j]=1-a[j];
			}
		}
		int ans=0;
		for(int i=1;i<=n;i++){
			if(a[i]==1)ans++;
		}
		printf("%d\n",ans);
	}
}
/*======================================代码结束=====================================*/ 
/*
*简单题
*模拟即可
*注意多组
*数组每次需要归零 
*/		
